# WFD-YOLO (YOLOv12n-based)
# Custom modules: WFCA, SFPA, DGFA, ATFL

nc: 9
atfl:
  enable: true
  tau: 0.6
  lambda: 1.5

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, WFCA, []]                  # 5  (P3/8 enhancement)
  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]     # 7
  - [-1, 1, Conv, [1024, 3, 2]]        # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]    # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [7, 1, SFPA, []]                              # 11 lateral P4 purification
  - [[10, 11], 1, DGFA, []]                       # 12 replace Concat
  - [-1, 2, A2C2f, [512, False, -1]]              # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [5, 1, SFPA, []]                              # 15 lateral P3 purification
  - [[14, 15], 1, DGFA, []]                       # 16 replace Concat
  - [-1, 2, A2C2f, [256, False, -1]]              # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                    # 18
  - [13, 1, SFPA, []]                             # 19 head P4 purification
  - [[18, 19], 1, DGFA, []]                       # 20 replace Concat
  - [-1, 2, A2C2f, [512, False, -1]]              # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                    # 22
  - [9, 1, SFPA, []]                              # 23 backbone P5 purification
  - [[22, 23], 1, DGFA, []]                       # 24 replace Concat
  - [-1, 2, C3k2, [1024, True]]                   # 25 (P5/32-large)

  - [[17, 21, 25], 1, Detect, [nc]]               # 26 Detect(P3, P4, P5)
